In [238]:
import pandas as pd
import requests

EP = "https://raw.githubusercontent.com/ppabam/nextjs-fastapi-starter/refs/heads/main/endpoints.json"

In [239]:
res = requests.get(EP)

In [240]:
#res.status_code

In [241]:
#res.encoding

In [242]:
#res.text

In [243]:
#res.json()

In [244]:
data = res.json()

In [245]:
type(data)

dict

In [246]:
endpoints = data['endpoints']

In [247]:
type(endpoints)

list

In [248]:
for p in endpoints:
    print(f'{p["name"]}, {p["url"]}')  #안에 큰따옴표 쓸거면 밖은 작은따옴표 써야함 -> f' 이렇게

TOM, https://ac.sunsin.shop/api/py/select_all
jiwon, https://agecal.wodan10.shop/api/py/select_all
heejin, https://age.journeyjean.shop/api/py/select_all
hyun, https://agecalculator.calcalhan.store/api/py/select_all
cho, https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all
jacob, https://jacob0503.vercel.app/api/py/select_table
nuni, https://ac.nunininu.shop/api/py/select_all
lucas, https://ac.lucas12.store/api/py/select_all
SEO, https://ac.seo-sigma.shop/api/py/select_all
JERRY, https://jooon.vercel.app/api/py/select_all

In [249]:
# df_nuni = 
# df_jacob = 
res = requests.get("https://ac.nunininu.shop/api/py/select_all")
# res.status_code
data = res.json()
df_nuni = pd.DataFrame(data)
df_nuni.head(1)

                 menu_name  name          dt
0  크림소스에버무린파스타그런데이제양송이를곁들인  nuni  2025-02-06

In [250]:
# df_nuni = 
# df_jacob = 
res = requests.get("https://jacob0503.vercel.app/api/py/select_table")
# res.status_code
data = res.json()
df_jacob = pd.DataFrame(data)
df_jacob.head(1)

  menu ename          dt
0  짜장면   TOM  2025-02-03

In [251]:
print(df_new)

   id  name
2   4  PARK

In [252]:
# 나의 df에 없는 row를 찾아 서 새로운 df 만들기

# new_rows = []
# for _, row_j in df_jacob.iterrows():
#     is_match_row = True
#     for _, row_n in df_nuni.iterrows():
#         is_match_columns = True
#         for c_name in df_nuni.columns:
#             if row_j['c_name'] != row_n['c_name']:
#                 pass
            
#     if not is_match_row:
#         now_rows.append(row)

# df_new = pd.DataFrame(new_rows)  --코드 다시 살펴봐야함

In [253]:
# 나의 df에 없는 row를 찾아 서 새로운 df 만들기

new_rows = []

for _, row_2 in df2.iterrows():
    is_match_row = False
    for _, row_1 in df1.iterrows():
        is_match_columns = True
        for c_name in df1.columns:
            if row_2[c_name] != row_1[c_name]:
                is_match_columns = False
                break
            
        if is_match_columns: 
            is_match_row = True
    
    if not is_match_row:
        new_rows.append(row_2)

df_new = pd.DataFrame(new_rows)

    #if is_match_row:
    #    pass
    #else:
    #    new_rows.append(row2)

#df_new = pd.DataFrame(new_rows)

In [254]:
import pandas as pd 

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4, 5], "name": ["MIN", "LEE", "PARK", "TOM"]})
df3 = pd.DataFrame({"id": [5, 4, 2, 3], "name": ["TOM", "PARK","MIN", "LEE"]})

In [255]:
from pandasql import sqldf
query = """
SELECT df2.id, df2.name
FROM df2
LEFT JOIN df1
ON df2.id = df1.id AND df2.name = df1.name
WHERE df1.id IS NULL
"""

pysqldf = lambda q: sqldf(q, globals())

def pysqldf(q):
    sqldf(q, locals())

df_diff_1 = sqldf(query, locals())
df_diff_1

   id  name
0   4  PARK
1   5   TOM

In [256]:
new_rows = []

for _, row_2 in df2.iterrows():
    is_match_row = False
    for _, row_1 in df1.iterrows():
        is_match_columns = True
        for c_name in df1.columns:
            if row_2[c_name] != row_1[c_name]:
                is_match_columns = False
                break
                
        if is_match_columns:
            is_match_row = True

    if not is_match_row:
        new_rows.append(row_2)
        
df_diff_2 = pd.DataFrame(new_rows)
df_diff_2

   id  name
2   4  PARK
3   5   TOM

In [257]:
# pandas merge 기능 사용한 코드 SQL에서 right join과 유사.

merge_df = pd.merge(df1, df2, how='right', indicator=True)

In [258]:
merge_df

   id  name      _merge
0   2   MIN        both
1   3   LEE        both
2   4  PARK  right_only
3   5   TOM  right_only

In [259]:
# pandas merge 기능 사용한 코드 . SQL에서 right join과 유사.

merge_df = pd.merge(df1, df3, how='right', indicator=True)

In [260]:
df_diff_3 = merge_df[merge_df['_merge'] == 'right_only'].drop('_merge', axis=1)
df_diff_3

   id  name
0   5   TOM
1   4  PARK

In [261]:
merge_df = pd.merge(df1, df2, how='right', indicator=True)

In [262]:
#_merge == left_only인 것만 남기고
#_merge 컬럼은 지우고

#merge_df[merge_df['_merge'] == 'left_only'].drop('_merge', axis=1)

In [263]:
# pandas merge 기능 사용한 코드 SQL에서 inner join과 유사.

#merge_df = pd.merge(df1, df2, how='inner', indicator=True)
#merge_df

In [264]:
# pandas merge 기능 사용한 코드 SQL에서 outer join과 유사.

#merge_df = pd.merge(df1, df2, how='outer', indicator=True)
#merge_df

In [265]:
df_diff_1 = sqldf(query, locals())
df_diff_2 = pd.DataFrame(new_rows)
df_diff_3 = merge_df

In [266]:
print(df_diff_1)

   id  name
0   4  PARK
1   5   TOM

In [267]:
print(df_diff_2)

   id  name
2   4  PARK
3   5   TOM

In [268]:
print(df_diff_3)

   id  name      _merge
0   2   MIN        both
1   3   LEE        both
2   4  PARK  right_only
3   5   TOM  right_only

In [269]:
## TODO
#df_diff_1, df_diff_2, df_diff_3 의 결과가 같은지 비교
#df_diff_1 == df_diff_2 == df_diff_3
df_diff_3.reset_index(drop=True).equals(df_diff_2.reset_index(drop=True))

False

In [270]:
df_diff_1.reset_index(drop=True).equals(df_diff_3.reset_index(drop=True))

False

In [271]:
df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)

   id  name      _merge
0   2   MIN        both
1   3   LEE        both
2   4  PARK  right_only
3   5   TOM  right_only

In [272]:
df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)

   id  name
0   4  PARK
1   5   TOM

In [273]:
df_diff_3.columns.tolist()

['id', 'name', '_merge']

In [274]:
d3 = df_diff_3.sort_values(by=['id','name']).reset_index(drop=True)
d1 = df_diff_1.sort_values(by=['id','name']).reset_index(drop=True)
d3.equals(d1)

False